# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# number = (input("Введите трехзначное число: "))
# if len(number) == 3:
#     sum = 0
#     num = int(number)
#     while num != 0:
#         sum = sum + num % 10
#         num = num//10
#     print(f"{number} -> {sum}")
# else:
#     print("Вы ввели нетрехзначное число.")


# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно,
# что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# quantity = int(input("Введите общее количество журавликов: "))
# if quantity % 6 == 0:
#     p = quantity // 6
#     k = p * 4
#     s = p
#     print(f"{quantity} -> {p} {k} {s}")
# else:
#     print(f"Задача не может быть решена в целых числах, если количество журавликов {quantity}.")


# Задача 6: Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером # 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

# number = input("Введите шестизначный номер билета: ")
# if len(number) == 6:
#     count = len(number)
#     num = int(number)
#     first_part = 0
#     second_part = 0
#     while count > 3:
#         first_part += num % 10
#         num = num // 10
#         count = count - 1
#     while count > 0:
#         second_part += num % 10
#         num = num // 10
#         count = count - 1
#     if first_part == second_part:
#         print (f"{number} -> yes")
#     else:
#         print (f"{number} -> no")
# else:
#     print("Вы ввели нешестизначное число.")


# Задача 8: Требуется определить, можно ли от шоколадки
# размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

# n = int(input('Введите число n: '))
# m = int(input('Введите число m: '))
# k = int(input('Введите число k: '))
# if k % n == 0 or k % m == 0:
#     print(f"{n} {m} {k} -> yes")
# else:
#     print(f"{n} {m} {k} -> no")